[{"header":"On this page",
"content":"Content policy (applies to all users of the API)\nApp review (when you're ready to launch a product)\nDefault requirements\nAdditional safety constraints for some types of application\nsDisallowed applications\nSafety best practices (suggestions and tips for responsible\n development)Recommendations\nUnderstanding safety & risks"},
{"header":"Content policy",
"content":"We prohibit users from knowingly generating—or allowing others to knowingly generate—the following categories of content:\nHate: content that expresses, incites, or promotes hate based on identity.]\nHarassment: content that intends to harass, threaten, or bully an individual.]\nViolence: content that promotes or glorifies violence or celebrates the suffering or humiliation of others.]\nSelf-harm: content that promotes, encourages, or depicts acts of self-harm, such as suicide, cutting, and eating disorders.]\nAdult: content meant to arouse sexual excitement, such as the description of sexual activity, or that promotes sexual services (excluding sex education and wellness).]\nPolitical: content attempting to influence the political process or to be used for campaigning purposes.]\nSpam: unsolicited bulk content.]\nDeception: content that is false or misleading, such as attempting to defraud individuals or spread disinformation.]\nMalware: content that attempts to generate ransomware, keyloggers, viruses, or other software intended to impose some level of harm."},
{"header":"App review",
"content":"As part of our commitment to safe and responsible AI, we require API applications to go through a short review to ensure they comply with our policies and safety requirements. We welcome experimentation on our API, but you must submit your application for review as soon as it is being actively used for its intended purpose (beyond just development and testing).\nIf you are unsure whether you need to submit your application for review, you should submit if any of the following are true:\nYou have more than 10 end-users (this includes internal users if your application is an internal tool).\nYour application is available on the open web for anyone to use.\nYou are charging or otherwise earning income from your application.\nYou are exceeding $250 of quota per month.1 (Request more quota here)"},
{"header":"Note:",
"content":"Any approvals apply to the application as it is presented in your submission. Significant changes in scope (e.g. features, target user, domain) require additional review (you may either resubmit the form or contact us by email). You do not need to notify us about changes to the visual appearance of your application's interface.\nYour API access may be revoked if you fail to submit your application for App Review or launch without approval. If you are concerned about this, please reach out to support@openai.com immediately.\nIf you are planning a demo at an event (such as conferences, hackathons, Reddit) that will showcase live API outputs in any capacity, please email support@openai.com with at least 2 weeks advance notice. We’re happy to work with you on a case-by-case basis."}]